      *****************************************************************
      *         I D E N T I F I C A T I O N   D I V I S I O N         *
      *****************************************************************
        IDENTIFICATION DIVISION.

        PROGRAM-ID.   US.
      * AUTHOR.       W CLAYTON.
      * INSTALLATION.  COMDATA NETWORK, INC.
      * DATE-WRITTEN. 11/23/80.

      * REMARKS.      ON-LINE FUEL TRANSACTION PROGRAM.
KB1007******************************************************************
KB1007*  COMPILE OPTIONS: LANG=ECC, DB2=Y, 2/CXXCMCD1/CXXCOW/UR, MQ=Y
      ******************************************************************
MB1112*  COMPILE US USING 5.1 INSTEAD OF COMPIT TO PICK UP SPEC CHAR
MB1112******************************************************************
      * FUNCTION....: ON-LINE FUEL TRANSACTION PROGRAM                 *
      * TRAN ID.....: 'FP'                                             *
      * LANG........: COBOL II (CICS)                                  *
      * DESCRIPTION.: THIS PROGRAM HAS SEVERAL FUNCTIONS, LISTED BELOW *
      *               1)  FP (FUEL) TRANSACTION                        *
      *               2)  FP CANCEL TRANSACTION                        *
      *               3)  SETTLEMENT REQUEST                           *
      *               4)  FP MAINT ON/OFF REQUEST                      *
      ******************************************************************
      *                    MODIFICATION TABLE
      *
      * NAME       DATE   DESCRIPTION
      * ========== ====== ==============================================
      * SCHLEICHER PREV   IF YOU NEED TO SEE THE OLD MODIFICATION TABLE
      *                   PLEASE COME SEE ME.  I HAVE IT FILED.
      * SCHLEICHER 031493 1)REMOVED ALL ALTERS/HANDLE CONDITIONS
      *                   2)REMOVED ALL DEAD CODE
      *                   3)REMOVED ALL RECURSION
      *                   4)CREATED SEVERIAL NEW ROUTINES TO REPLACE GOT
      *                   5)PSR #1132 - REEFER/DIESEL DAILY LIMITS
      *                          1259 - RETURN NAME,CITY,STATE ON POS XT
      *                          1262 - SUPPORT TERMINAL,FUNDED,DB XTNS
      *                                 SAME LOCATION CODE
      * SCHLEICHER 031593 ADDED LOGIC TO HANDLE ALL AMERICAN
      * SCHLEICHER 031793 PSR #1260 - LIMITED NETWORK BY SC LOCATION
      *                       #1374 - MAX GALLONS BY STATE/ALL STATE
      *                       #1314 - IGNORE TERM FUEL LIMITS
      * SCHLEICHER 032993 REMOVED THE FORCED 'US' COMPANY LOGIC
      * C. PRYOR   031893 PSR #1160 - ONE-TIME W/ PO OVERRIDE NOT
      *                               WORKING PROPERLY IF TOTAL > 99999
      * C. PRYOR   041593 PUT SWITCH IN READ-CDNCUST ROUTINE SO THAT
      *                   ONE-TIME AMOUNTS WILL ONLY BE ADDED TO AVAIL
      *                   AMTS FIRST TIME THROUGH
      * C. PRYOR   041993 FIX PROBLEM W/ PREVIOUS CHANGE, RESET SWITCH
      *                   EACH TIME PRMCARD IS READ
      * SCHLEICHER 042693 FIXED PROBLEM WITH IGNORE TERM FUEL LIMITS @
      *                   AN AUTO-GAS LOCATION
      * R PROCTOR  050393 CHANGED BATCH-LOAD-ROUTINE TO LINKED MODULE
      * SCHLEICHER 052593 JUL-DATE-LINK WAS ZEROES WHEN IT WENT TO
      *                   ROLL-PROD-TOTALS.  THIS CAUSED THE CURRENT
      *                   USED AMOUNT ON PRODUCTS TO ALWAYS BE ZERO.
      *            052593 CHANGED COMDATA COMPLETE, DRIVER CARRIED
      *                   CARD, TO CHARGE THE COMCHEK FEE.
      * C PRYOR    052593 ADDED LOGIC FOR CASH PER GALLON LIMIT
      * SCHLEICHER 060893 PSR#1369 - CHECK TO SEE IF WE CHARGE NORMAL
      *                   FEE FOR TRANSLINK TRANSACTIONS
      * SCHLEICHER 060993 PSR#1546 - ALLOW COST PLUS TYPE 'U' AT TERM
      *                   FUEL LOCATION.
      * SCHLEICHER 060993 PSR#1586 - ONLY CHECK CREDIT ON THE BILLABLE
      * SCHLEICHER 060993 PSR#1685 - ADD CANADIAN TAX ID TO FMLOG
      * C PRYOR    061193 PSR#1571 - FOR VRU, IGNORE PURCHASE LIMIT
      * SCHLEICHER 061493 PSR#1678 - IGNORE 2HR CHECK IF CUST OR SC
      *                              IS FLAGGED TO DO SO.
      * C PRYOR    070193 ADD LOGIC FOR PERCENT OF FACE DISCOUNT
      *                   (PENSKE PROJECT).
      * SCHLEICHER 070693 PSR#1768 - ALLOW PO TO OVERRIDE MAX GALLONS
      * SCHLEICHER 071693 CONVERTED TO COBOL II.
      * C PRYOR    072693 PSR#1878 - FIX BALANCE BASED DISCOUNT PART NET
      *                              PART REBATED - ONLY PASS NET AMOUNT
      *                              TO CARD
      * SCHLEICHER 072793 PSR#1883 - CHANGE INTRA-DAY CONTROL# TO SHOW R
      * SCHLEICHER 081693 PSR#1942 - CHANGE INTRA-DAY CONTROL# TO SHOW R
      * SCHLEICHER 081893 PSR#1838 - USE MASTER CODE ON 2HR CHECK
      *                   PSR#1575 - USE MASTER CODE ON 2HR CHECK
      *                   PSR#1763 - IGNORE UNIT # ON 2HR CHECK
      *                   PSR#1687 - MAKE CN225 GET CITY/STATE/TAXID
      *                   PSR#1883 - MAKE US225 GET CITY/STATE INFO
      * SCHLEICHER 090293 FIX AUTOGAS INVOICE PROBLEM (EMERG CHANGE)
      * C PRYOR    090793 PSR#1997 - ALLOW PRODS @ NONDESIGNATED LOCATIO
      * C PRYOR    090993 FIX PAY-AT-LOAD DISCOUNT PROBLEM
      * SCHLEICHER 092093 PSR#2162 - COST PLUS ADD ON
      * C PRYOR    092193 PRJ#73   - ADD LIMITED NETWORK BY CARD
      * R PROCTOR  101393 PRJ#     - CHANGE RJ3 LAYOUT TO MATCH TSFMB010
      * SCHLEICHER 110193 INCREASED TRIP NUMBER FROM 9 TO 10 BYTES
      * SHOTTS     111293 SCMSTR FILE EXPANSION
      * SCHLEICHER 111893 ADDED NEW SETTLEMENT LOGIC
      * PRYOR      112293 EXPANDED SCMSTR HOLD AREA LENGTH
      * SCHLEICHER 020194 CHANGED FMRM LOGIC TO USE TSFMO0RX LINKABLE PG
      * VERNON     033194 SPLIT RETAIN-FEE INTO 'P' & 'R' FOR PREFERRED
      * SCHLEICHER 050194 REWORKED MOST OF THE CODE TO IMPROVE ITS
      *                   INSPECTOR SCORE
      * SCHLEICHER 050594 CHANGES FOR COMDATA COMPLETE RECOURSE
      *                   PROJECT #111
      * C. PRYOR   092994 CHANGES FOR FFE (PROJECT #112) AND PSR #289
      * SCHLEICHER 100394 CHANGES FOR ATM/SECONDARY CARD PROJECT
      * C. PRYOR   122294 FIX FOR MIN. CASH PER GALLON
      * C. PRYOR   122594 CHANGE FORMAT FOR START OF PSNS  (NATS)
      * SCHLEICHER 01??95 - INTRA DAY CHANGES FOR MIXED CURRENCIES
      *                   - ATM CHANGES (NO FREE XTNS)
      *                   - ADDED OIL LIMITS
      * C. PRYOR   052395 - PSR # 1023 - ADDED MANUAL PREFERRED FEE
      * SCHLEICHER 062695 - PSR # 1384 - AUTO-GAS PUMP NUMBER
      * C. PRYOR   081795 - ADDED SETTLEMENT CODE TO FMLOG
      * SCHLEICHER 112895 - CORRECTED ATM REVERSAL PROBLEM
      * SCHLEICHER 121295 - SEND WARNING MESSAGE ON COMCHEK/FDIS CARDS
      * THOMASON   010596 - INSERTED WRITES TO PRMCARD BACKUP FILES
      * C. PRYOR   030196 - PSR # 1694 - TRAILER HR EDITS
      * C. PRYOR   031896 - PSR # 1713 - TRAILER POOL MASTER CODE
      * C. PRYOR   032296 - PSR # 1893 - EXPANDED RESPONSES TO TRENDAR
      *                                  REDUCED CO FEES (FUEL ONLY)
      * SCHLEICHER 042396 - PSR # ???? - ADDED 1-TIME OFF NETW PURC THAT
      *                                  IS SETUP BY CARD
      * C. PRYOR   072996 - PSR # 2095 - ADDED 'DB' OR 'DBF' TO TRENDAR
      *                                  NET AMOUNT RESPONSES
      *                       # 2081 - ADD DATE TO ERROR RESPONSE
      *                       # 1653 - REAL-TIME, CHANGE TERM.FUEL TYPE
      * C. PRYOR   081596 - PSR # 1503 - CHECK "DEFAULT" RECORD FOR
      *                                  LIMITED NETWORK BY CARD
      * C. PRYOR   102296 - PSR # 2129 - CHARGE STANDARD T/S FEE FOR CAS
      *                                  PREFERRED XTNS & ZERO OUT RETAI
      *                                  REBATE
      *                     PSR # 2101 - CHANGE TRIP REQUIRED FLAG TO 'C
      *                                  VR800 TRANSACTIONS
      *                     PSR # 2103 - VALIDATE HUB READING NUMERIC IN
      *                                  REAL-TIME ERROR XFER
      *                     PSR # 2118 - CARD CHECK DIGIT NOT ALWAYS SET
      *                                  REAL-TIME ERROR XFER; MOVED CHE
      *                                  DIGIT TO WS-PRM-CARD IN
      *                                  20060-GET-CARD-CUST-INFO
      * SCHLEICHER 111896 - ADDED CUSTOM TAXES FOR COST PLUS
      * SCHLEICHER 121896 - ADDED RISK MANAGED FUEL
      * C. PRYOR   032197 - SET INDX IN FPU-CHECK-PROD2 AND
      *                     FPU-CHECK-PROD2 TO PREVENT STORAGE VIOLATION
      *                     AND ASRA
      * M. PERRY   032497 - EFS ATM PHASE 1
      * SCHLEICHER 050197 - PSR #2328 (ONE TIME OFF NETWORK
      * SCHLEICHER 052797 - PSR #2203 (TRUNCATION PROBLEM WITH FOCUS CPG
      * SCHLEICHER 052797 - PSR #1712 (INVOICE TOTAL ERROR ON POS)
JS2000* SCHLEICHER 102497 - YEAR 2000 (JS2000)
CP0298* C. PRYOR   020398 - PRJ # 461 - TEXACO
JS0298* SCHLEICHER 020498 - PASSAGE PLUS (SPECIAL PAYTO FOR SETTLE)
MP0303* M PERRY    030398 - NEW NATS PROCESSING
JS0498* SCHLEICHER 040798 - CORRECT PROBLEM WITH CANCEL (PAYTO SPECIAL)
JS0498* SCHLEICHER 040998 - CHANGE COST PLUS DISCOUNTS TO ALLOW A NET
JS0498*                     DISCOUNT FOR DIRECT BILL XTNS.  (CHANGED TO
JS0498*                     MATCH FOCUS)
JS0598* SCHLEICHER 050698 - CORRECT PROBLEM WITH TRAILER NR FLAG = 'E'.
JS0598*                     IT WAS NOT WORKING ON POS TRANSACTIONS.
CP0598* C. PRYOR   050698 - REMOVE COPYBOOK AND REFERENCES FOR "SETTLEC"
CP0598*                     ("OLD SETTLEMENT")
CP0698* C. PRYOR   061898 - PRJ#558 - ADD UNIT POOL MASTER CODE
JS0798* SCHLEICHER 072398 - GENERIC CREDIT FUEL
JS0898* SCHLEICHER 081798 - CORRECT PROBLEM WITH GOLD CARD FUEL PURCHASE
MP0898* M. PERRY   081798 - PRJ # 543 - MAESTRO POS
JS0998* SCHLEICHER 081798 - COMSITE BATCH
CP1098* C. PRYOR   100298 - PRJ#672 -(SCHNEIDER) ADD NEW COST PLUS FLDS
CP1098*                                              ADJUSTMENTS FIELDS
CP1098*                                              SUB NETWORK GROUP
CP1098*                                              MULT. COMPANY STD
CP1098*                                          REMOVED PRMDLPM LOGIC
JS1098* SCHLEICHER 081798 - ADDED NO FEE FLAG AND PROCESSING
MP1098* M. PERRY   102898 - ADDITIONAL MAESTRO CHANGES.
JS1198* SCHLEICHER 110698 - IF CUST COUNTRY = 'C ' REPLACE WITH 'CD'
MP1298* M. PERRY   102898 - ADDITIONAL MAESTRO CHANGES.
JS1198* SCHLEICHER 113098 - AUTO CARD ACTIVATE
JF1298* SCHLEICHER 122098 - SCHNEIDER FIXES
ED0199* E. DUGAN   010499 - CHANGE NATSLOG FILE LOGIC
JS0299* SCHLEICHER 011599 - CORRECTED PROBLEM WITH PO OVERRIDE AND PRODS
JSA199* SCHLEICHER 012199 - IF VERIFY-UNIT = 'N' IGNORE UNIT USED AMTS
CP0399* C. PRYOR   030899 - FIX TO NOT SEND ERROR FOR ITP2 AND PS42
CP0399* C. PRYOR   032299 - ADD NUMERIC CHECKS - FIX ASRA
CP0499* C. PRYOR   040299 - MOVE PERFORM OF PARAGRAPH
CP0499*                     20350-CALC-COST-FOR-TERM-FUEL
MP0599* M. PERRY   051299 - NATS REORG WEEKLY
MP0599* M. PERRY   051299 - PETRO RECEIVABLES CORRECTION.
CP0599* C. PRYOR   051499 - COMMENT OUT RESRTICING DIESEL AND OTHER
CP0599*                     FUEL AT UNATTENDED LOCATIONS WHEN
CP0599*                     CDN-REFER-ONLY = 'Y'
JS0699* SCHLEICHER 060599   CHANGED TO ALWAYS COMPUTE CANADIAN TAX
MP0699* PERRY      061499 - SEND A VALID RESPONSE WHEN FILES ARE CLOSED
MP0699*                     ON TCP/IP TRANSACTIONS.
JS0699* SCHLEICHER 063099   CHANGED CANADIAN TAX RATES
CP0799* C. PRYOR   071599 - FIX PROBLEM W/ RETAINED PREFERRED DISCOUNTS
MP0799* M. PERRY   071999 - ALL ACCESS TO CASH ON CARD AND EXPRESS CASH
ED0899* E. DUGAN   081699 - EXPAND IOL PRODUCT CODE
JS0999* SCHLEICHER 090699 - CONVERT RETAIL PPG STORED IN FMLOG TO BE
JS0999*                     STORED IN THE CURRENCY OF THE COMPANY
JM0999* - - - - - - - - - - - - - - - -- - - - - - - - - - - - - - - -
JM0999* 09/22/99 J. MAPLES - SPC - CHANGED CREDITL COPY BOOK TO
JM0999*                            EXPAND SELECTED NUMERIC FIELDS
JM0999* - - - - - - - - - - - - - - - -- - - - - - - - - - - - - - - -
JS1099* 10/04/99 SCHLEICHER- CORRECTED CANADIAN CHECK AND VRU PROBLEM.
MP1099* 10/18/99 M PERRY   - CORRECT EFS ATM INQUIRE FEE
MP1199* 11/01/99  M. PERRY   RECOMPILED FOR SIGN ON AMOUNT IN TSXCW030
JS1199* 11/28/99 SCHLEICHER- MASTER CARD PROJECT
MP1299* 12/08/99 M PERRY     CORRECT A PROBLEM WITH MAESTRO SURCHARGES
MP0100* 01/07/00 M PERRY     CORRECT PURCHACE AMOUNT AVAILABLE FOR
MP0100*                      QUICK FUEL PRE-AUTH.
MP0200* 02/02/00 M PERRY     DECLINE ATM TRANSACTIONS WHEN A FILE
MP0200*                      PROBLEM OCCURS.
JS0200* 02/02/00 SCHLEICHER  CHANGED TO USE COMPANY STANDARDS CASH ON
JS0200*                      CARD FLAG INSTEAD OF CDNCUST.
JS0200* 02/10/00 SCHLEICHER  CHANGED TO USE FLEET FLAT FEE ON FLEET XTNS
JS0200* 02/15/00 SCHLEICHER  ADJUST DRIVER NUMBER IF FLEET CUSTOMER
MP0200* 02/21/00 M PERRY     CORRECT PROBLEM OF BILLING FOR ATM DECLINE
MP0200*                      WHEN FUEL TURNED OFF.
JS0200* 02/23/00 SCHLEICHER  CORRECTED PROBLEM WITH FUEL PRICE UPDATES.
JS0200*                      SCFUELP WAS NOT GETTING UPDATED
JS0300* 03/03/00 SCHLEICHER  ADDED MASTERCARD XTN TIME
CP0300* 03/10/00 C.PRYOR     UNIT VERIFY 'N' - IF SPACES IN
CP0300*                      PRM-UNIT-NUMBER CLEAR PRM-FP-CARD-NO
MP0300* 03/13/00 M.PERRY     ADJUST FOR AVAILABILITY OF SPECIFIC
MP0300*                      PRODUCTS WHEN DOING A PRE-AUTH.
MP0300* 03/21/00 M.PERRY     DO NOT ALLOW REFER ON PRE-AUTH WHEN BLOCKED
JS0400* 04/05/00 SCHLEICHER  HARD-CODE PAM TRANSPORT TO NOT SHOW ZERO IN
JS0400*                      FUEL FEE IF FUEL AND CASH WAS PURCHASED
CP0400* 04/20/00 C.PRYOR     PRJ# 758 - PAC PRIDE - ALLOW FOR PERCENT
CP0400*                      OF FACE FUEL FEES AND SERVICE CENTER CORP.
CP0400*                      REBATES
JS0500* 05/04/00 SCHLEICHER  - CORRECTED PROBLEM WITH POS CANCEL AND
JS0500*                         SC MASTER CODES
JS0500*                      - CORRECTED PROBLEM WITH LINK TO CXXCO0PL
JS0600* 06/01/00 SCHLEICHER  - CHANGE UNIT VERIFY LOGIC FOR FLEET XTN
JS0600* 06/08/00 SCHLEICHER  - ADDED ADDR AND ZIP TO FMLOG
CP0600* 06/22/00 C.PRYOR     PRJ# 758 - NEW SIR-DI-FEE-TYPE
MP0600* 06/12/00 M PERRY     - PETRO CANADA
CP0700* 07/20/00 C.PRYOR     - INCLUDE CASH IN "PERCENT OF FACE" SC
CP0700*                        RATE CALCULATIONS
JS0700* 07/24/00 SCHLEICHER  HARD-CODE TT984 TO NOT SHOW ZERO IN
JS0700*                      FUEL FEE IF FUEL AND CASH WAS PURCHASED
073100* 07/31/00 C.PRYOR     - RE-EXCLUDED CASH FROM "PERCENT OF FACE"
073100*                        SC RATE CALCULATIONS
CP0800* 08/15/00 C.PRYOR     - PRJ.#825 - ADD SC CASH ADD-ON FEE
MP0800* 06/01/00 M. PERRY    - BILL SAVINGS AND CREDIT CARD
JS0900* 09/15/00 SCHLEICHER  - CORRECTED PROBLEM WITH CREDIT PREAUTH AMT
MP0900* 09/21/00 M. PERRY    - RETURN DATE FOR PETRO CANADA
JS1000* 10/20/00 SCHLEICHER  - DON'T USE COST PLUS FOR SCHNEIDER IC DRVR
JS1000*                      - FOR SUB-NETWORK 999 OPEN ALL PRODUCTS
030601* 03/06/01 J HUNTER    - ENHANCEMENTS TO SCFUELP FILE UPDATE LOGIC
JS0401* 04/01/01 SCHLEICHER  - CORRECTED PROBLEM WITH CUSTID RETURNED TO
JS0401*                        SERVICE CENTER
JS0401* 04/02/01 SCHLEICHER  - DB2 CONVERSION
MP0401* 04/11/01 M PERRY     - ADD SPECIAL INTRA-DAY FOR MASS CONNECTION
JS0601* 06/19/01 SCHLEICHER  - IGNORE UNIT LENG EDIT FOR 'C' UNIT VERIFY
MP1001* 10/11/01 M PERRY     - ADD EMAIL DEBIT FROM CASH ON CARD
JS1101* 11/11/01 SCHLEICHER  - MASTERCARD CARD RENEWAL
ED1101* 11/12/01 E DUGAN     - INSTANT CREDIT NOTIFICATION
ED0102* 01/21/02 E DUGAN     - PASS CREDITL UPDATES TO MSG HANDLER
ED0102* 01/21/02 E DUGAN     - PASS PRMCARD UPDATES TO MSG HANDLER
MP0302* 03/13/02 M PERRY     - CORRECT E-MAIL CASH ADVANCE
MP0402* 04/09/02 M PERRY     - ALLOW ATM REVERSAL AFTER 2 HOURS
CC0502* 05/07/02 CHAFIN      - ADD US FLEET - MOBIL FUELING LOGIC
JS0702* 08/16/02 SCHLEICHER  - DON'T CHARGE FEE FOR TA ON CASH ONLY
JS0802* 08/02/02 SCHLEICHER  - ADDED SYNCPOINT AND CHANGED CARD ENQ
MP0902* 09/30/02 M PERRY     - MASTERCARD DIRECT
ED1102* 11/23/02 E DUGAN     - ADD REPORTING LEVELS TO FMLOG
CC0303* 03/04/03 CHAFIN      - 1.ADDED 3 NEW BATCH STAND-IN INPUT FIELDS
      * 03/20/03 CHAFIN      - DON'T FORCE 'W' SRV-TYPE FOR STAND-IN
JS0303* 03/06/03 SCHLEICHER  - ADDED A FORMATTED RESPONSE FOR BATCH FUEL
MP0303* 03/26/03 M PERRY     - ADD PSA1 F NEW DIAL THROUGH TCP/IP
CC0403* 04/16/03 CHAFIN      - FIX FMBP 'FUEL PRICE ERROR' CHECKING
CC040A* 04/24/03 CHAFIN      - FIX WH 'FUEL PRICE ERROR' CHECKING
CC040B* 04/25/03 CHAFIN      - FMLOG EXPANSION
062403* 06/24/03 J HUNTER    - SETINFO FIELD EXPANSION, RECOMPILE ONLY
JS0803* 08/06/03 SCHLEICHER  - CORRECTED PROBLEM WITH BLANK PROD CODES
JS0803*                      - CHANGED CXUTS0EL TO PRODUCE A DUMP
CC0803* 08/08/03 CHAFIN      - MOBIL FUEL ENHANCEMENTS
091003* 09/10/03 J HUNTER    - ROLL UP OF PENDING COMDATA COMPLETE STATU
MP0903* 09/20/03 M PERRY     - ATM STANDIN ON TANDEM
EJ1203* 11/15/03 E JONES     - FMRELAT CONVERSION - RECOMPILE ONLY
JS1203* 12/04/03 SCHLEICHER  - CUSTID CONVERSION FOR FPMASTR
JF1203*                      - CORRECTED CANADIAN XTN DUP CHECK
ED1203* 12/18/03 E DUGAN     - ADD PRMPIN FOR PIN
JS0304* 01/27/04 SCHLEICHER  - CORRECT ASRA ABEND WITH USILOG GALLONS.
JS0304*                        CORRECT PROBLEM WITH CREDIT TRUNCATION
MP0204* 02/24/04 M PERRY     - ADD NO VERIFY TRANSACTION FOR ACCOR
MP0404* 04/19/04 M PERRY     - DO NOT CHECK CREDIT ON BALANCE BASED
JS0604* 06/01/04 SCHLEICHER  - PRODUCT CODE EXPANSION
MP0704* 07/08/04 M PERRY     - ADDITIONAL PRODUCT CODE CHANGES
JS0804* 08/25/04 SCHLEICHER  - REMOVED THE NEED FOR CREDIT OVERRIDE FOR
JS0804*                        XTNS OVER $1,499.99.
MP1004* 10/29/04 M PERRY     - CUST ID EXPANSION
MP1204* 12/13/04 M PERRY     - CORRECT PRODUCT CODE IN INTRA-DAY RECORD
MP0105* 01/06/05 M PERRY     - CORRECT PRODUCT DAILY MAX ERROR
MP0105* 01/06/05 M PERRY     - ADD TRANSACTION PSD1 FOR TCP/IP POS
MP0205* 02/17/05 M PERRY     - CORRECT XXXXX ON MCAUTH
MP0205* 02/22/05 M PERRY     - CORRECT BALANCE BASED CANCEL CHARGES
CP0405* 04/28/05 C PRYOR     - CHANGE START OF FPLG TO PUT TO MQ QUEUE
ED0505* 05/13/05 E DUGAN     - ADD NEW PRODUCTS TO NATS PROD TABLE
CP0505* 05/23/05 C PRYOR     - USE MQ FOR FPLG ON FP CANCEL
EJ0505* 05/24/05 E JONES     - BP ON US
MP0605* 06/13/05 M PERRY     - CORRECT FP CANCEL ON NON SETTLE LOC
CP0605* 06/28/05 C PRYOR     - INITIALIZE DRIVER NAME FOR VEHICLE CARD
MP0705* 07/15/05 M PERRY     - BP INTERUM
MP0705*                           ADD OTHER FUEL SUB PRODUCT CODE
MP0705*                           REMOVE PRMABUP PRMBBUP
MP0705*                           CHECK BATCH LOAD FLAG BEFORE REREADING
MP0705*                           PRMCARD
072705* 07/27/05 J HUNTER    - VEHICLE CARD MAINTENANCE: LINK TO
072705*                        CXXCO0OH WITH FPMASTR BEFORE/AFTER
JS0705* 07/29/05 SCHLEICHER  - ALLOW 10 DIGIT UNIT FOR BATCH (FMMP)
MN0905* 09/22/05 M.NEWTON    - WR# 715 PASS QUICK FUEL MERCHANT NUMBER
MN0905*                        TO SETINFO.
MN0905*                        PT# 2005.10.20.047-AC05 - EXPAND
MN0905*                        WS-TOTAL-PRICE TO CORRECT A
MN0905*                        CALCULATION TRUNCATION.
MN0905*                        CORRECT NATS AUTH ABEND ERRORS.
MP1105* 11/29/05 M PERRY       CORRECT PROCESSING OF PO OUT OF NETWORK
MP1105*                        ON THE SMART FUEL PRE-AUTH
MN1205* 12/07/05 M.NEWTON      WR# 814 - COKE LEADING ZERO ON UNIT
MP0106* 01/19/06 M PERRY       RECOMPILE WITH CORRECT TSXCW030 COPYLIB
MB0106* 01/26/06 M BOWEN       ADD WRITE TO ITDQ FOR MC INTRA-DAY
JS0206* 02/25/06 SCHLEICHER    PRODUCT FEES PROJECT
040606* 04/05/06 J HUNTER      USE CDN BLOCK #2 DIESEL FLAG
EJ0406* 04/10/06 E JONES       BP PLAN C - ADD BIN LOGIC
ED0406* 04/12/06 E DUGAN       ENQUEUE REPLACEMENT
CP0406* 04/19/06 C PRYOR       ULSD - ADD LOGIC FOR SUB PROD CODES
JS0606* 06/11/06 SCHLEICHER    ADDED NETW BY CARD BOTH OPTION FLAG
JS06J6* 06/13/06 SCHLEICHER    ADDED .75 GALLON ALLOWANCE ON NETW BY CRD
ED0606* 06/14/06 E DUGAN       SAFEWAY ENCASHMENT
MN0606* 06/22/06 M.NEWTON    - WR468 - SCHNEIDER FMRM 04 MODIFICATIONS
ED0606* 06/28/06 E DUGAN       ADD SUB PRODUCT HDR FOR CANADIAN
CP0706* 07/05/06 C PRYOR       CHECK FUEL + GST FOR > 999.99
MP0706* 07/26/06 M PERRY       ADDITIONAL CHANGES FOR SAFEWAY ENCASHMENT
ED0906* 09/27/06 E DUGAN       DYNAMIC BINS 1.2
ED1206* 12/04/06 E DUGAN       FIX IOL INVALID CARD NR
ED1206* 12/06/06 E DUGAN       FIX SYSTEM UNAVAILABLE MSG
JS0107* 01/16/07 SCHLEICHER    ADD DEFAULT PRODUCT FEE LOGIC.
JS0107* 01/16/07 SCHLEICHER    REMOVE SCHNEIDER HARD CODE FOR COST PLUS
SB0107* 01/29/07 S BOLING      US RELEASE
MB0207* 02/05/07 M.BOWEN       US RELEASE - TMI MC INTRA-DAY
MN0207* 02/05/07 M.NEWTON      US RELEASE
CP0207* 02/19/07 C.PRYOR       IVR REPLACEMENT
MP0407* 04/23/07 M PERRY       FIX PROB WITH NO PRDLMIT RECORD.
CP0807* 08/01/07 C PRYOR       FPMASTER REPLACEMENT
JS0907* 09/05/07 SCHLEICHER    CORRECTED THE RESPONSE FOR LARGE $ TXNS.
MN0907* 09/20/07 M.NEWTON      INCIDENT 29293 - CORRECT LIMITED NETWORK
MN0907*                                         BY GROUP ERROR.
KB1007* 10/01/07 K BRUCE       GSA CROSS BORDER #10055 PRJ06216
KB1007*                          ADD XBORDER FEE CALCULATION
BW1207* 12/20/07 B WEBB        INCIDENT 36110 - SMART FUEL PREAUTH FIX
CP0208* 02/26/08 C PRYOR       FIX ADF-FP-ID-NR FOR CANCELS (CHK DIGIT
CP0208*                         NOT SET)
CP0208* 02/28/08 C PRYOR       ADD ODR-PREMIER-CARD NUMERIC CHECK
CP0308* 03/04/08 C PRYOR       CORRECT READ TO UNITMST ON CANCEL
021908* 02/19/08 J HUNTER      GSA/HIERARCHY PROJECT
MB0408* 04/02/08 M BOWEN       INCIDENT 36114 FORCE POST TRANSACTIONS
MB0408*                           REJECTED FOR INVALID UNIT
KB0408* 04/11/08 K BRUCE       GSA CROSS BORDER #10055 ADDITIONS WITH
KB0408*                        HIERARCHY PROJECT  PRJ06305
KB0408*                          ADD FM1/12 FLAGING USING TSFMW001.ADF-
KB0408*                          CIR-MAESTRO-INTL-FLAG IN PLACE OF ADF-
CP0508* 05/13/08 C PRYOR       FIX ISSUE WITH DEQ ON CARD
MP0608* 06/12/08 M PERRY       ADDITIONAL CHANGES FOR HIERARCHY.
MP0608*                        AND CROSS BORDER
DS0608* 06/20/08 D STRICKL     FIX ON DRIVER INFOR/ VEHICLE CARD
DS0608* 07/08/08 K BRUCE       ADDITIONAL CHANGES FOR CROSS BORDER
KB0708*  (021908 THRU KB0708 WILL IMPL ON 08/10/08 W/ HIERARCHY)
082008* 08/20/08 J HUNTER      FUEL > 999, INTERIM
MN1008* 10/20/08 M.NEWTON      WR2241-DONLEN MASTERCARD PIN ENTRY AND
MN1008*                        INCIDENTS 48353, 54085, 56807 AND 59340.
MN1108* 11/20/08 M.NEWTON      DRAFT COMCHEK PURCHASING - PROJECT 10713
CW1108* 11/25/08 C.WALKER      REBATES AND DISCOUNTS
MP1208* 12/11/08 M PERRY       INCIDENT 80714 FIX PRE-AUTH CREDIT.
JS0109* 01/09/09 SCHLEICHER    CHANGED NETWORK BY CARD GALLON VARIANCE
JS0109*                        FROM 0.75 TO 5.00
      *** THE FOLLOWING CHANGES ARE INCLUDED IN A SINGLE PROD RELEASE
062209* 06/22/09 J HUNTER      CHG TIME-LIMIT-CHECK TO CHK FOR DUP TRANS
062209*                        ON FUEL AND PRIVATE LABEL GROCERY ONLY
062609* 06/26/09               KEEP CARD SWIPED/KEYED FLAG ON FMLOG
070909* 07/09/09               MAKE CARD ONE TIME OFF NETWORK WORK SAME
070909*                        AS FMRM 02 ONE TIME FLAG
071009* 07/10/09               USE CANADIAN GST TAX IN FUEL > 999 LOGIC
071409* 07/14/09               USE PROMPTED ID TO VALIDATE PIN POOL
071509* 07/15/09               DISALLOW VIRTUAL CARD AT PROPRIETARY LOC
071609* 07/16/09               FIX FOR CURRENCY ISSUES, PRM- USED AMTS
080309* 08/03/09               ZERO OUT CASH ADVANCE FEE FOR PETRO CHAIN
CP0809* 08/03/09 C PRYOR       ADD DEBUG LOGGING XCML FOR COST PLUS
092009* 09/20/09 J HUNTER      CORRECTION TO LENGTH OF WS-Q-AREA
      *** THE PRECEDING CHANGES ARE INCLUDED IN A SINGLE PROD RELEASE
CP1109* 11/19/09 C PRYOR       MORE DEBUG LOGGING XCML FOR COST PLUS
112409* 11/24/09 J HUNTER      CORRECT SCREEN EXIT ON DUPLICATE ERROR;
112409*                        ADD NATS PRODUCT CODES 24 AND 25
091509*** THIS CHG WAS MOVED ASIDE FOR PREV CORRECTIONS
091509* 09/15/09 J HUNTER      GLOBAL CREDIT PROJECT, CREDITL -> DB2
CP0110* 01/07/10 C PRYOR       ADD DEBUG LOGGING CONDITIONS
040510* 04/05/10 J HUNTER      SWITCH REPLACEMENT PROJECT, RELEASE 4
CP0710* 07/21/10 C PRYOR       INC 214323 - NOT LOGGING EXPANDED UNIT
CP0710*                        NUMBER (UNIT VERIFICATION "N"); LOST
CP0710*                        IN UNITMST CONVERSION
080210* 08/02/10 J HUNTER      IRIS PROPRIETARY PROJECT
      *** THE FOLLOWING 5 CHANGES ARE INCLUDED IN A SINGLE PROD RELEASE
083010* 08/30/10 J HUNTER      SWITCH REPLACEMENT PROJECT, RELEASE 6
083110* 08/31/10 J HUNTER      IRIS CORRECTIONS AND ENHANCEMENTS
CP0910* 09/01/10 C PRYOR       INC 215028 - ISSUE W/ CN PROD PRE-AUTH
CP0910* 09/01/10 C PRYOR       INC 213603 - ISSUE W/ CN FUEL PR VERIFY
090310* 09/03/10 J HUNTER      WR 2758 - BATCH FUEL COST PLUS DT LOGIC
      **********
      *** THE FOLLOWING 4 CHANGES ARE INCLUDED IN A SINGLE PROD RELEASE
102110* 10/21/10 J HUNTER      FIX HIERARCHY PRODUCT LIMITS LOGIC
102510* 10/25/10 J HUNTER      FIX PRE-AUTH CHK WHEN BALANCE = FEE AMT
102810* 10/28/10 J HUNTER      ALTERNATIVE FUEL PROJECT
123010* 12/30/10 J HUNTER      CHG FOR IRIS COUNTRY CODE
      **********
020711* 02/07/11 J HUNTER      FOLLOWUP CORRECTIONS, ALTERNATIVE FUEL
BW0211* 02/14/11 B WEBB        MASTERCARD DEBIT RELEASE 11.1
ED0311* 03/02/11 E DUGAN       FIX PROPRIETARY FLEET LIMITS STAND IN
JS0311* 03/07/11 SCHLEICHER    COMPUTE SC POF FEE USING GROSS LESS DISC
MP0411* 04/07/11 M PERRY       CHANGE TO PUT SETINFO TO MQ QUEUE
041111* 04/11/11 J HUNTER      CORRECTION TO MOBILE FUEL HUB EDITS
051611* 05/16/11 B WEBB        WORK REQUEST RELEASE 2011_1 & 2011_2:
052311*                        3369 - GST TAX OVER $99.99
      *                        3424 - VARIOUS INCIDENTS:
052611*                           256926 - LARGE XTNS CONVERSION ISSUES
052711*                           NONE   - DUE TO ROUNDING, SOMETIMES
052711*                                    THE SPLIT XTN TOTAL DOLLAR
052711*                                    AMOUNTS ARE OFF BY $.01.
MN0611*                           233483 - FORCE POST FIX FOR DUP. XTNS
MN0611*                           268777 - XTN SHOWING CANCELLED ON SETL
072611*                           278415 - PRE-AUTH HUB MIN/MAX FIX
072711*                        3384 - ALLOW PREAUTH ON KEYED IN CARD NBR
072811*                        3514 - CANADIAN ICA PROJECT CHANGES
MB0911* 09/27/11 M BOWEN       CANADIAN ICA - REPLACE FCUR WITH CXXCO0CL
JS1111* 11/03/11 SCHLEICHER    ADDED ALT-FUEL DISC APPLIES FLAG LOGIC
J11111* 11/21/11 SCHLEICHER    CORRECTED ALTFUEL DISC APPLIES FLAG LOGIC
      *** THE FOLLOWING 4 CHANGES ARE INCLUDED IN A SINGLE PROD RELEASE
091211* 09/12/11 J HUNTER     STABILITY CHANGES, TO STANDARDIZE ABEND
091211*                       ROUTINES AND REMOVE CUSTID REFORMAT
091411* 09/14/11 J HUNTER     PILOT/LOVES NETWORK PRICING
CP1011* 10/28/11 C PRYOR      CONTROL NUMBER EXPANSION
CP1011*                       INC 297087
MP1011* 11/07/11  M PERRY     STREAMLINE DATE CHANGE - SETTLEMENT
MP1011*                       PROCESS
      **********
013112* 01/31/12 J HUNTER     CANADIAN ICA PCR, IRIS PROCESS CHANGES
020712* 02/07/12 J HUNTER     PILOT/LOVES NETWORK PRICING PCR
022012* 02/20/12 J HUNTER     HANDLE NETWORK PRICING FOR LARGE SPLIT TRX
022112* 02/21/12 J HUNTER     CANADIAN ICA PCR, CREDITL CURRENCY CHGS
040912* 04/09/12 J HUNTER     ECASH IRIS INTEGRATION PROJECT
040912*                       AND INCIDENT TICKETS 306403, 309208
041112* 04/11/12 J HUNTER     CARDLESS SOLUTIONS PHASE 1B
050712* 05/07/12 J HUNTER     NETWORK PRICING FILE SIZE CHG REQUEST
052912* 05/29/12 J HUNTER     FIX SP14 TRAILER LIMITS ON RFID TRANS
060512* 06/05/12 J HUNTER     ADJ TO NETWORK PRICING FOR REBATED DISC
061212* 06/12/12 J HUNTER     NETWORK PRICING CURRENCY CORRECTIONS
JS0712* 07/10/12 SCHLEICHER   MODIFIED TO PROCESS ATM ON FLEET LIMITS
ED0712* 07/17/12 E DUGAN      ECASH IRIS INTEGRATION PROJECT PCR
MN0712* 07/31/12 M.NEWTON     3974-COMSITE II-INVALID CHECK NUMBER
082212* 08/22/12 J HUNTER     FUEL FINDER WORK REQUEST
MB0912* 09/13/12 M BOWEN      IN330812 CANADIAN TRANS DIRECT BILL FUNDED
MB1012* 10/01/12 M BOWEN      CARDLESS PHASE 2.1
MB1112* 10/18/12 M BOWEN      CARDLESS PHASE 2.2
113012* 11/30/12 J HUNTER     ADD RFR RACK PPG TO TSFMO0GD COMMAREA
120412* 12/04/12 J HUNTER     CORRECTION TO SPLIT TRANS FMLOG DISCOUNT
MP0113* 01/02/13 M PERRY      CORRECT DATE FORMAT FOR
MB0113* 01/08/13 M BOWEN      FLEET STORY 1 - REMOVE CARDLESS 1HR LOGIC
SB0113* 01/14/13 S BOLING     FLEET STORY 14- INC0025567 ATM SURCHG FIX
ED0113* 01/17/13 E DUGAN      FLEET STORY 15- INC0021347 & INC0023481
ED0113* 01/18/13 E DUGAN      FLEET STORY 12 TRUNCATION > 999
ED0213* 02/20/13 E DUGAN      FLEET STORY 27 RFID CASH W/MIN FP QTY
MN0313* 03/11/13 M.NEWTON     FLEET STORY 13 - US GST SPLIT
SB0313* 03/22/13 S.BOLING     FLEET STORY 23 - FP CANCEL CHANGE FOR
      *                       CARD MOVE.
MN0413* 04/02/13 M.NEWTON     SPRINT 5-STORY 52-SPLIT ON GST
SB0413* 04/29/13 S.BOLING     SPRINT 6-STORY 75-
      *                       RFID LAST PURCHASE DATE INITIALIZATION
SB0513* 05/08/13 S.BOLING     FLEET STORY 46 - AUTH LIMIT CHANGES
      *                       RFID LAST PURCHASE DATE INITIALIZATION
SB0713* 07/14/13 S.BOLING     FLEET STORY 46 - FIX OTHER FUEL USED AMOUT
072213* 07/22/13 S.BOLING     FLEET STORY 88 - TERMINAL FUEL OVERRIDE
072313* 07/23/13 S.BOLING     FLEET STORY 46 - FIX OTH USED CALC
SB0813* 08/30/13 S BOLING     FLEET STORY B03217 - FIX OTH ASRA ABEND
MB1013* 10/29/13 M BOWEN      FLEET B03922 - FMRM 02 MANUAL FP TRANS
MB1013*                       FLEET B03924 - ADD 20000 LEVEL LIM FOR MC
MB1013*                       ALSO, FIX INC0082897
MB1113* 11/07/13 M BOWEN      FLEET B03928 - CARD EXPIRATION REMAINS
MB1213* 12/02/13 M BOWEN      FLEET B03382 - DRAFT REGISTRATION VIA IVR
MB0114* 01/06/14 M BOWEN      FIX FOR PROD ABENDS (LEN OF Q-COMMAREA)
BG0114* 01/27/14 B GANN       FLEET B-02951 - XCDM EXCLUSIONS
SB0114* 01/28/14 S BOLING     FLEET B-04531 - CAN TAXES AFTER DISCOUNTS
SB0214* 02/26/14 S BOLING     FLEET B-04531 - CHG DISCOUNT FIELD USED
022714* 02/27/14 S BOLING     FLEET B-04531 - PASS CTRL# TO TSFMO0CT
030114* 03/01/14 S BOLING     FLEET B-04531 - MORE CAN TAX CHANGES
030514* 03/05/14 S BOLING     FLEET B-04531 - ADD CHECK OF RMR-NATS-FLAG
030614* 03/06/14 S BOLING     FLEET B-04531 - ROUND US TAX ON FMLOG.
SB0414* 04/16/14 S BOLING     FLEET D-01172 - STOP CANADIAN TAX CALC FOR
SB0414* 04/16/14              TA TRAVEL CENTERS.
SB0514* 05/05/14 S BOLING     D-01144 - FIX ISSUE WITH PRICING FILE
SB0514*                       DISCOUNTS WHEN GETTING DISCOUNT BY PRODUCT
SB0614* 06/10/14 S BOLING     FLEET OTR - MERCHANT SURCHARGE EFFORT 1
072314* 07/23/14 B WEBB       SPLIT TAXES ON SPLIT XTNS BY PRODUCT CODE
MB0714* 07/24/14 M BOWEN      FLEET B-08304 USE FMRACKH RACK HIST FILE
SB0814* 08/04/14 S BOLING     FLEET OTR - FMRM SUB PRODUCT CODE LIMITS
SB0814*                                 - MERCHANT SURCHRG DUP TRNS FIX
SB0814*                                 - MERCHANT SURCHRG EXP PRODUCTS
080614* 08/06/14 S BOLING     FLEET OTR - CHK COMCASH FLG FOR PREPAID
081414* 08/14/14 S BOLING     FLEET OTR - SP14 ADD CUST DATA TO RESPONSE
ED0814* 08/14/14 E DUGAN      FLEET OTR - EXCLUDE DIAL SP14 CUST DATA
MN0814* 08/18/14 M.NEWTON     TK20885 AND TK21831 - ADDITIONAL FIELDS TO
MN0814*                       IRIS MQ
SB0914* 09/03/14 S BOLING     FLEET OTR - SP14 ADDITIONAL CHANGES.
ED0914* 09/08/14 E DUGAN      FLEET OTR - QA FIND COMCASH FLAG
091614* 09/16/14 S BOLING     FLEET OTR - SET MAX QTY TO 99999 DEFAULT.
091914* 09/19/14 S BOLING     FLEET OTR - COMCASH FIX FOR BALANCED BASED
092214* 09/22/14 S BOLING     FLEET OTR - CURRENCY CONV OF QUANTITIES
092414* 09/23/14 S BOLING     FLEET OTR - FIX MULTIPLE PRODUCTS IN ONE
092414*                       CATEGORY ON SP14 WITH FLEET LIMITS = Y
SB1014* 10/06/14 S BOLING     FLEET OTR - FIX SP14 20000 LEVEL QTYS
100914* 10/09/14 S BOLING     FLEET OTR - UNIT GROUP CHANGES.
101014* 10/10/14 S BOLING     PROGRAM DEBT CHANGES.
ED1014* 10/22/14 E DUGAN      FLEET OTR - ADDITIONAL UNIT GROUP CHANGES
101314* 10/13/14 S BOLING     FLEET OTR DEFECT D-01602. (INC0130174)
101314*                       ONE TIME CASH ADVANCE ERROR.
102414* 10/24/14 B WEBB       FIX FOR CHANGE MADE 072314
102714* 10/27/14 S BOLING     FLEET OTR - B-01580 SPLIT DISCOUNT IN
102714*                       INTRADAY TRANSACTIONS
SB1114* 11/06/14 S BOLING     FLEET OTR DEFECT D-01142. (INC0087893,
SB1114*                       INC0114534, INC0096653) BALANCED BASED
SB1114*                       PRICING FILE DISCOUNTS DO NOT SHOW IN
SB1114*                       SALES JOURNAL AS FOCUS DISCOUNTS.
111814* 11/18/14 S BOLING     FLEET - B-11079 POPULATE NEW FMLOG FIELDS
111814*                       MISC 3 & TANK CAPACITY.
112014* 11/20/14 S BOLING     FLEET OTR - B-10123 RESET LIMITS AFTER
112014*                       ONE TIME LIMIT ON FMRM.
112514* 11/25/14 B WEBB       FIX SONAR ISSUE - CRITICAL - RECURSION
120914* 12/09/14 B WEBB       FLEET - B-11459 - 'P' PRICING FILE OPTION
SB0115* 01/20/15 S BOLING     FLEET B-11819 MINIMUM AND GALLON UP FEES
012315* 01/23/15 B WEBB       D-01975 - ISSUE W/ CAN SPLIT XTN'S W/ DISC
013015* 01/30/15 S BOLING     D-01995 - UPDATE OTHER USED QTY ON PRMINFO
013015*                       ON FP CANCEL TRANS.
SB0315* 03/17/15 S BOLING     D-12740 - FUEL UP
SB0415* 04/10/15 S BOLING     D-12740 - FUEL UP CALCULATION CHANGE
SB0615* 06/15/15 S BOLING     D-02384 - FUEL UP CORRECTION OF DAILY
SB0615*                       CREDIT LIMIT.
SB0615*                       D-02383 - FUEL UP FP CANCEL FIX.
061615* 06/16/15 S BOLING     D-12579 - IGNORE FUEL LIMIT CHECK IF
061615*                       PRODUCT NOT PURCHASED.
061715* 06/17/15 S BOLING     B-13958 - RETURN AVAILIBLE AMOUNT ON SP08
061715*                       WHEN FUEL FLAGGED NO AND PRODUCTS PURCHASE
061815* 06/18/15 S BOLING     D-02365 - CANADIAN TAX CORRECTION ON
061815*                       SPLIT TRANSACTIONS.
SB0715* 07/09/15 S BOLING     D-02365 - CHG SPLIT LOGIC FOR AUTO CALC=Y
072315* 07/23/15 S BOLING     D-02507 - PUT OTHER FUEL ON LAST SPLIT TRN
MB0715* 07/27/15 M BOWEN      D-02452 - DON'T USE FMRACKH RATE > 90 DAYS
MB0715* 07/29/15 M BOWEN      B-15085 - FUEL UP PPG UPDATE TIMEFRAME
ED0815* 08/31/15 E DUGAN      B-15146 - CARD PRE VALIDATION - CLC
BG0915* 09/24/15 B GANN       B-16348 - CLC CANCEL
SB1115* 11/19/15 S BOLING     D-02806 - SP14 FUEL=N PRODUCT=Y FIX
DR1115* 11/19/15 D REED       B-17358 - MOBILE FUEL PRICE VALIDATION
SB0116* 01/26/16 S BOLING     D-02922 - ALLOW MASTERCARD MINIMUM FEES
SB0116*                       D-02926 - FIX ABEND IN SP14 POPULATION RTN
DR0116* 01/28/16 D REED       B-10334 - ID MATCH NUMBER PROPRIETARY
SB0316* 03/02/16 S BOLING     B-20132 - ALLOW MASTERCARD GALLON UP FEES
042816* 04/28/16 J HUNTER     D-03141 - FIX CAT SCALE TRANS FOR INTRADAY
050316* 05/03/16 J HUNTER     B-18716 - ADD NATS PRODUCT CODES 34 & 35
SB0516* 05/20/16 S BOLING     B-22672 - SMALL FLEET DISCOUNT
SB0616* 06/01/16 S BOLING     B-22763 - ALLOW SECOND TRANSACTION FEE
DR0616* 06/22/16 D REED       D-03186 - DONLEN ISSUE WITH X7 EXPIRATION
080116* 08/01/16 B WEBB       B-24162 - ALLOW HUB TO PASS THROUGH FOR
080116*                       REEFER XTN'S IF IT IS A MOBILE FUEL XTN
PM0916* 09/28/16 P MCLENDON   B-24034 AUTH WITH NET PRICING FILE INSTEAD
PM0916*                       OF FMRM FOR OTHER FUEL PRODUCTS
DR1016*          D REED       COMPLETION OF B-24034
BG1116* 11/18/16 B GANN       NAT STORY B-26840 - PERMIT PRE-AUTH
DR0117* 01/10/17 D REED       B-28010 - HUB VALIDATION FOR REEFER
SB0217* 02/08/16 S BOLING     B-28572 - COMCHEK MOBILE LIMITS
DR0317* 03/22/17  D REED      B-29360 - IF PRICE VALIDATION NO DISCOUNTS
CP0417* 04/12/17  C PRYOR     INC0247114 - HUB READING ON UNIT
CP0417*                       GETTING UPDATED ON PRODUCT ONLY PURCHASE
PM0517* 05/02/17 P MCLENDON   B-30701 MOBILE FUEL RATE CUSTOMIZATION
DR0817* 08/04/17  D REED      B-31184 - IF QUANTITY IS BELOW THRESHOLD
DR0817*                                DO NOT VALIDATE THE PRICE
VD0917* 09/13/17  V DEVAPOOJA B-31216 - ONROAD CREDIT TRANSACTIONS DEBIT
VD0917*                       BALANCE CASH ON CARD AVAILABILITY
DR1117* 11/09/17  D REED      B-34229 - SWIFT MOT START TRAN FMTB
VD0218* 02/07/18  V DEVAPOOJA D-04800 FIX FP CANCEL ABEND ONROAD CARD
JS0218* 02/20/18  SCHLEICHER  PRICE FILE USE BUS-RULES TO SPLIT DISC
JSH318* 03/22/18  SCHLEICHER  FLEET COMM B-37084 PRICING REL 'P' FOR
JSH318*                       HUSKY/NEW CSTPLUS USE OPT FOR PRICE FILE
JSH318*   - THIS 'P' OPTION IN PRICE FILE ALREADY EXISTED FOR OTH FUEL
JSH318*     SEE CHANGE BECKY WEBB MADE 120914 (IN POS 1-6)
AT0418*     COPYBOOK CHANGES FOR PILOT PRICING
BG0418* 04/20/18  B. GANN     B-37480 - ADD PRICE FILE COST PLUS
BG0418*                       COMPONENTS TO FMLOG.
CP0618* 06/01/18  C. PRYOR    B-34391 - ALLOW VC FOR BATCH FUEL
JS0618* 06/28/18  JSCHLEICHER D-04903 - HUSKY/SPLIT XTN WITH TAX ISSUE
AT0618* 06/28/18  ATAUNTON    D-04903 - CORRECT MULTI SPLIT ISSUE
AT0918* 09/18/18  ATAUNTON     D-05599 - CORRECT TAX ISSUE
AT1218* 12/18/18  ATAUNTON     D-????? - CORRECT CASH ADVANCE
SR0119* 01/22/19  SRAMDHAVE    B-41729 NAT INFINITY CODES - RECOMPILE
SD0219* 02/26/19  S DIPPIE     B-42740 PILOT CAN TAXES - COUNTING TWICE
SD0719* 07/18/19  S DIPPIE     B-45495 MULTIPLE TRIP NUMBERS
SD0819* 08/02/19  S DIPPIE     D-06438 FIX S0C7 ABEND ISSUE WITH TSFMO0G
SD0919* 09/18/19  S DIPPIE     B-47641 UNIT PHASE US CAPTURE 10 CH UNIT
SD1219* 12/12/19  S DIPPIE     B-41420 FM81, CORRECT CANADIAN TAX 03 REC
SD0320* 03/05/20  S DIPPIE     D-07042 FIX TRANS DECLINE (EXP DATE)
SD0220* 02/13/20  S DIPPIE     B-44804 CORRECT DEFECT IN FM12
PJ0520* 05/14/20  P JAIN       B-52349 NEW WRITE CONTROL CHAR 'M' FOR
PJ0520*                        MOBILE AND 'C' FOR EMV.
DR0620* 06/01/20  D REED       B-51989 CHANGE WHERE PRMINFO WRITE IS
DR0620*                        DONE SO IT WILL NOT CREATE ISSUE IN
DR0620*                        PRMRFLOG FOR BILL AT PICKUP EPIC CHANGES
SD0620* 06/24/20  S DIPPIE     FP-5 FUEL PROXIMITY CHANGES
SD0920* 09/11/20  S DIPPIE     FP-620 UPD EXP DATE WHEN WRITE CTL M OR C
SD1020* 10/15/20  S DIPPIE     FP-812 ADJUST FUEL QTY FROM CXXCO0TE
SD1020* 10/15/20  S DIPPIE     FE-419 EXCLUDE HOLD AMT FOR 1 TIME OFF CS
SD1220* 12/07/20  S DIPPIE     FE-1478 DO NOT UPDATE PRODUCT USED FOR
SD1220*                        1-TIME OFF COMP STANDARD MC CARD
SD1220* 12/07/20  S DIPPIE     FE-1479 FIX INTRADAY REBATE INDICATOR
JS1220* 12/07/20  J SCHLEICHER FE-1369 CANADIAN PILOT PRICING ISSUE
SD0321* 03/03/20  S DIPPIE     FE-2060 CORRECT SP14 REPLY FOR CUSTOMERS
SD0321*                        ON FLEET LIMITS
SD0321* 03/08/20  S DIPPIE     FE-258 SP11 NOT UPDATING PRICE ON SCMM
DR0121* 01/06/21  D REED       FE-1057 VALIDATE CVC1
MP0221* 02/26/21  P MANOJ      FE-2004 CVC1 VALIDATION. HANDLE TRNXS
MP0221*                        THAT DON'T HAVE CVC1 SENT IN.
DR0321* 03/30/21  D REED       FE-2004 IF CHIP USAGE CHG SVC TO 999
DR0321*                        BEFORE VALIDATING CVC1
SD0401* 04/01/21  S DIPPIE     FE-2326 CVC1 - VALIDATE THE CHIP CVC WHEN
SD0401*                        THE CHIP IS READ AT POS SP1, SP8, SP14
PJ0421* 04/15/21  P JAIN       FE-2416 CVC1 - REMOVE THE LOGIC THAT
PJ0421*                        CHANGES A KEYED TO SWIPED
SD0521* 05/20/21  S DIPPIE     FE-2754 CVC1 VALIDATION ADDITIONAL CHANGE
SD0521*                        FOR CHIP SENT IN AS SWIPE
SD0521* 06/16/21  S DIPPIE     FE-3052 CASH ON CARD ATM ADVICE, DO NOT
SD0521*                        DO CVC1 CHECK
MP0821* 08/03/21  MANOJ P      FE-3422-PFJ-CHANGE UPDATE LOGIC OF FIELD
MP0821*                        FMDL-SMFL-DISCOUNT TO MOVE TO TSFMO0CD.
AA0921* 09/08/21  A ALBERT     B-42138 DYNAMIC BIN RANGE
BG0122*********THE NEXT TWO STORIES WILL GO INTO PRODUCTION TOGETHER.
BG0122* 01/11/22  B GANN       FE-3461 - TREAT INACTIVE DRIVER ID AS NOT
BG0122*                        AVAILABLE.
011222* 01/12/22  B GANN       FE-4286 - LINK TO TSFMO0TX FOR TAX EXEMPT
SD0122* 01/06/22  S DIPPIE     FE-4262 CHECK FOR CVC1 ON PRE-AUTH
SD0222* 02/01/22  S DIPPIE     FE-4018 BREAK OUT FUEL TYPE DISCOUNTS
DR0422* 03/31/22  D REED       SE-1077 NALP CVC EPIC
      ******************************************************************

      *==============================
       ENVIRONMENT DIVISION.
      *==============================
      *------------------------------
        CONFIGURATION SECTION.
      *------------------------------
         SOURCE-COMPUTER. IBM-4300.
         OBJECT-COMPUTER. IBM-4300.

      *==============================
       DATA DIVISION.
      *==============================
      *------------------------------
        WORKING-STORAGE SECTION.
      *------------------------------
MB0106 01  WS-TIMESTAMP.
MB0106     05 WS-CURRENT-TIMESTAMP       PIC X(26).
MB0106     05 WS-TIMESTAMP-GMT           PIC X(26).
MB0106     05 WS-GMT-HOURS               PIC S999       COMP-3.
091411     05 WS-TIMESTAMP-NP            PIC X(26).
080210***** 19-CHARACTER TIMESTAMP USED FOR IRIS DATA
080210     05 WS-TS-WORK.
              10 WS-TS-DATE.
                 15 WS-TS-CEN                  PIC  9(02).
                 15 WS-TS-YEAR                 PIC  9(02).
                 15                            PIC  X(01) VALUE '-'.
                 15 WS-TS-MON                  PIC  9(02).
                 15                            PIC  X(01) VALUE '-'.
                 15 WS-TS-DAY                  PIC  9(02).
              10                               PIC  X(01) VALUE '-'.
              10 WS-TS-TIME.
                 15 WS-TS-HOUR                 PIC  9(02).
                 15                            PIC  X(01) VALUE '.'.
                 15 WS-TS-MIN                  PIC  9(02).
                 15                            PIC  X(01) VALUE '.'.
                 15 WS-TS-SEC                  PIC  9(02).
080210     05 WS-TS-DATE-IN               PIC  9(04).
080210     05 WS-TS-TIME-IN               PIC  9(06).

MN0207 01  WS-PRD-ALLOW                PIC S9(05)V99  VALUE ZEROS.
MN0207 01  WS-PRD-CUR-DAY              PIC S9(05)V99  VALUE ZEROS.
ED0213 01  WS-CASH-GALLONS             PIC S9(5)V99         VALUE +0.
DR0317 01  WS-PRC-POS-VARIANCE         PIC S9V9(5) COMP-3 VALUE +0.
DR0422 01  WS-DUP-COUNTER-MAX          PIC S9(05) COMP-3 VALUE 10000.
DR0422 01  WS-NUM-7                    PIC  9(07) VALUE ZEROES.
DR0422 01  WS-NUM-9                    PIC  9(09) VALUE ZEROES.
DR0422 01  WS-NUM-15                   PIC  9(15) VALUE ZEROES.

      *-----------------------------*
      * DB2 COPYBOOKS AND WORK STUFF*
      *-----------------------------*
021908******** ALL INCLUDES EXCEPT SQLCA CHANGED TO COPY
021908******** SO YOU CAN SPECIFY WHICH COPY LIBRARY
JS1199     EXEC SQL INCLUDE SQLCA    END-EXEC.
JS1199     COPY DDRVRGRP.
JS1199     COPY DCUSDRVR.
CP1011     COPY DMCAUTH.
JS1199     COPY DCLUSKEY.
JS1199     COPY ONLNDFC.
CP0406     COPY DSBPRDXL.
CP0406     COPY DSBPRDDS.
SD0320     COPY DCRDTYUP.
DR0116*****  USED TO CALL TSXCS060 FOR ID MATCH NUMBER
DR0116     COPY TSXCW280.
021908***** DB2 TABLE DBO.HIERARCHY
021908     COPY DHIERACH.
021908***** DB2 TABLE DBO.HIER_NODE
021908     COPY DHINODE.
021908***** DB2 TABLE DBO.HIER_UNIT_GRP_NODE
021908     COPY DUNITNOD.
021908***** DB2 TABLE DBO.HIER_DRV_GRP_NODE
021908     COPY DHDRVNOD.
KB0408***** DB2 TABLE DBO.HIER_DRV_GRP_DRV
KB0408     COPY DHDRV.
102810***** DB2 TABLE DBO.PRP_PRE_AUTH
041112     COPY DPRPPAUT.
091411***** DB2 TABLE DBO.PFID_CUST_XREF
091411     COPY DPFIDCSX.
020712***** DB2 TABLE DBO.PFID_MAINT
PM0916     COPY DPFIDMNT.
091411***** DB2 TABLE DBO.NET_PRICING_HDR
091411     COPY DNETPHDR.
091411***** DB2 TABLE DBO.NET_PRICING
BG0418**   COPY DNETPRCG.
BG0418     COPY DNETPRC1.
CP1011***** DB2 TABLE DBO.TRNS_HIST
CP1011     COPY DXTNHIST.
041112***** DB2 TABLE DBO.RFID_XREF
041112     COPY DRFIDXRF.
041112***** DB2 TABLE DBO.CRD_TKN_XREF
041112     COPY DCRDTKNX.
SB0113***** DB2 TABLE DBO.CURR_RT
SB0113     COPY DCURRR.
100914***** DB2 TABLE DBO.CUST_UNIT
100914     COPY DCUSUNT.
100914***** DB2 TABLE DBO.CUST_UNIT_GRPS
100914     COPY DCUUGRP.
112014***** DB2 TABLE CXXCOW.PROD_LMT_NTWRK
112014     COPY SPRDLMTN.
SD0620***** FUEL/PROXIMITY COPYBOOK
SD0620     COPY CXXCW0TE.
011222***** TAX EXEMPT ACCOUNT COPYBOOK
011222     COPY DTAXEXEA IN CPYREL.

021908********** DB2 CURSORS
021908     EXEC SQL DECLARE CUR_HIER_DRV_NODE CURSOR FOR
              SELECT  NODE_ID,
                      DRV_GRP_ID
                FROM  DBO.HIER_DRV_GRP_NODE
                WHERE HIER_ID         = :DHDRVNOD.HIER-ID  AND
                      NODE_ID         = :DHDRVNOD.NODE-ID
                FOR READ ONLY WITH UR
           END-EXEC.

021908     EXEC SQL DECLARE CUR_HIER_DRV CURSOR FOR
              SELECT  B.DRV_ID,
                      B.DRV_GRP_ID,
DS0608                B.DRV_LST_NM,
DS0608                B.DRV_FST_NM,
DS0608                B.DRV_LIC_NBR,
DS0608                B.DRV_LIC_ST
                FROM  DBO.HIER_DRV_GRP_NODE  A,
                      DBO.HIER_DRV_GRP_DRV   B
                WHERE A.HIER_ID         = :DHDRVNOD.HIER-ID  AND
                      A.NODE_ID         = :DHDRVNOD.NODE-ID  AND
                      B.DRV_ID          = :DHDRV.DRV-ID      AND
                      A.HIER_ID         = B.HIER_ID          AND
                      A.DRV_GRP_ID      = B.DRV_GRP_ID
                FOR READ ONLY WITH UR
           END-EXEC.

102810     EXEC SQL DECLARE CUR_PRE_AUTH CURSOR FOR
              SELECT  PRE_AUTH_TS
                FROM  DBO.PRP_PRE_AUTH
                WHERE CRD_NBR         = :DPRPPAUT.CRD-NBR  AND
                      MRCH_NBR        = :DPRPPAUT.MRCH-NBR AND
                      PRE_AUTH_DT    >= :DPRPPAUT.PRE-AUTH-DT
                ORDER BY PRE_AUTH_TS DESC
                FOR READ ONLY WITH UR
           END-EXEC.

102810     EXEC SQL DECLARE CUR_PRE_AUTH_UPDT CURSOR FOR
              SELECT  PRE_AUTH_DT,
                      PRE_AUTH_TS,
                      D1_AMT_LIM,
                      D2_AMT_LIM,
                      RFR_AMT_LIM,
                      OTH_AMT_LIM,
                      OIL_AMT_LIM,
                      CASH_AMT_LIM
                FROM  DBO.PRP_PRE_AUTH
                WHERE CRD_NBR      = :DPRPPAUT.CRD-NBR     AND
                      MRCH_NBR     = :DPRPPAUT.MRCH-NBR    AND
                      PRE_AUTH_DT >= :DPRPPAUT.PRE-AUTH-DT AND
                      POST_FLG     < 'P'
                ORDER BY PRE_AUTH_TS DESC
                FOR READ ONLY WITH UR
           END-EXEC.

CP0405*-----------------------------*
CP0405* MQSERIES WORK FIELDS        *
CP0405*-----------------------------*
CP0405 01  MQM-GET-MESSAGE-OPTIONS.
CP0405     COPY CMQGMOV.
CP0405 01  MQM-CONSTANTS.
CP0405     COPY CMQV.
CP0405 01  MQM-PUT-MESSAGE-OPTIONS.
CP0405     COPY CMQPMOV.
CP0405 01  W03-PUT-BUFFER.
CP0405     05 W03-CSQ4BQRM.
CP0405     COPY CSQ4VB4.
CP0405
CP0405 01  W00-MESSAGE-BUFFER.
CP0405     03  MQM-OBJECT-DESCRIPTOR.
CP0405         COPY CMQODV.
CP0405     03  MQM-MESSAGE-DESCRIPTOR.
CP0405         COPY CMQMDV.
CP0405     03  W00-MSGBUFFER.
CP0405         05 W00-MSGBUFFER-ARRAY  PIC X(1) OCCURS 9950 TIMES.
CP0405
CP0405 01  WS-MQSERIES-WORK-FIELDS.
CP0405     05 WS-QNAME-OUTBOUND        PIC X(48) VALUE SPACES.
CP0405     05 WS-QLENGTH-OUTBOUND      PIC S9(9) BINARY VALUE 0.
CP0405
CP0405 01  W03-BUFFLEN                 PIC S9(9) BINARY VALUE 0.
CP0405 01  W03-HCONN                   PIC S9(9) BINARY VALUE 0.
CP0405 01  W03-HOBJ                    PIC S9(9) BINARY VALUE 0.
CP0405 01  W03-OPENOPTIONS             PIC S9(9) BINARY.
CP0405 01  W03-OPTIONS                 PIC S9(9) BINARY.
CP0405 01  W03-COMPCODE                PIC S9(9) BINARY.
CP0405 01  W03-COMPCODE-CHAR           PIC X(9)    VALUE SPACES.
CP0405 01  W03-REASON                  PIC S9(9) BINARY.
CP0405 01  W03-REASON-CHAR             PIC X(9)    VALUE SPACES.
CP0405
CP0405 01  WS-PGM-MQ-WORKFIELDS.
CP0405     05 WS-BATCH-QUEUE-NAME      PIC X(48)
CP0405        VALUE 'TSFM.FPLG.BATCH'.
CP0405     05 WS-ONLINE-QUEUE-NAME     PIC X(48)
CP0405        VALUE 'TSFM.FPLG.ONLINE'.
CP0405     05 WS-QLENGTH-FPLG          PIC S9(9)  VALUE +2260.
MP0411     05 WS-BTCHSET-QUEUE         PIC X(48)
MP0411        VALUE 'TSMM.MMBS'.
MP0411     05 WS-QLENGTH-BTCHSET       PIC S9(9)  VALUE +462.

      *-----------------------------*
      * DISCOUNT WORK AREA          *
      *-----------------------------*
082212 01  WS-FMCD-COMMAREA-CHG.
      ***** FIELDS PASSED TO TSFMO0CD THAT CAN BE CHANGED;
      ***** THESE FIELDS MOVED HERE FROM OTHER PARTS OF PROGRAM SO
      ***** THEY CAN BE MOVED AS A GROUP
           05 WS-COST-PLUS-USED         PIC  X(01)           VALUE 'N'.
           05 WS-SETTLE-DIRECT-BILL-FLAG  PIC  X(01).
JS0206     05 WS-PRD-CALC-TYPE          PIC  X(04).
082008     05 WS-MANUAL-FEE             PIC S9(5)V999 COMP-3 VALUE +0.
           05 WS-AMOUNT-OF-DISC-CPG     PIC S99V9999  COMP-3 VALUE ZERO.
           05 SAVE-FMDL-SC-INVOICE-AMT  PIC S9(5)V99  COMP-3 VALUE +0.
           05 WS-TOTAL-GALLONS          PIC S9(5)V99         VALUE +0.
           05 WS-TOTAL-FACE             PIC S9(6)V99         VALUE +0.
CP0700     05 WS-TOTAL-FACE-SC          PIC S9(6)V99         VALUE +0.
CP0800     05 WS-SC-AUTO-CASH-ADD-ON    PIC S9(6)V99         VALUE +0.
CP0800     05 WS-SC-MAN-CASH-ADD-ON     PIC S9(6)V99         VALUE +0.
082008     05 WS-BASE-FUEL-RATE         PIC S9(5)V99  COMP-3 VALUE ZERO.
082008     05 WS-MIXED-FUEL-RATE        PIC S9(5)V99  COMP-3 VALUE ZERO.
JS0206*** (PRODUCT FEES WORK AREA) ***
JS0206     05 WS-PRD-FEE-WORK-AREA.
JS0206      10 FILLER OCCURS 3 TIMES.
JS0206        15 WS-PRD-FEE-TYPE           PIC X(01).
JS0206        15 WS-PRD-FUNDED-RATE        PIC S9(5)V99 COMP-3.
JS0206        15 WS-PRD-DB-RATE            PIC S9(5)V99 COMP-3.
JS0206        15 WS-PRD-FUNDED-RATE-ALTCUR PIC S9(5)V99 COMP-3.
JS0206        15 WS-PRD-DB-RATE-ALTCUR     PIC S9(5)V99 COMP-3.
JS0206        15 WS-PRD-SC-RATE            PIC S9(5)V99 COMP-3.
JS0206        15 WS-PRD-SCM-AUTO-RATE      PIC S9(5)V99 COMP-3.
JS0206        15 WS-PRD-SCM-MANUAL-RATE    PIC S9(5)V99 COMP-3.
JS0206        15 WS-PRD-SCM-FLAT-OR-POF    PIC X(1).
JS0206     05 WS-PRD-FEE-SC-WORK-AREA.
JS0206      10 FILLER OCCURS 3 TIMES.
JS0206        15 WS-PRD-PROD-FEE           PIC S9(5)V99 COMP-3.
JS0206     05 WS-FMDL-PRODUCT-FEE-INFO.
JS0206       10 WS-FMDL-PRODUCT-FEES OCCURS 3 TIMES.
JS0206        15 WS-FMDL-PF-SC-FEE               PIC S9(05)V99  COMP-3.
JS0206        15 WS-FMDL-PF-SC-FEE-SOURCE        PIC X(01).
JS0206        15 WS-FMDL-PF-SC-FEE-LOC-TYPE      PIC X(02).
JS0206        15 WS-FMDL-PF-SC-FEE-TYPE          PIC X(01).
JS0206        15 WS-FMDL-PF-CUST-FEE             PIC S9(05)V99  COMP-3.
JS0206        15 WS-FMDL-PF-CUST-FEE-SOURCE      PIC X(01).
JS0206        15 WS-FMDL-PF-CUST-FEE-CUST-TYPE   PIC X(02).
JS0206        15 WS-FMDL-PF-CUST-FEE-TYPE        PIC X(01).
JS0298     05 WS-DISCOUNT-AND-FEE-AREA.
             10 WS-DC-DISCOUNT-AMT        PIC S9(5)V99 COMP-3 VALUE +0.
JS0298       10 WS-DC-SC-DISCOUNT-AMT     PIC S9(5)V99 COMP-3 VALUE +0.
             10 WS-DC-SC-REBATE-AMT       PIC S9(5)V99 COMP-3 VALUE +0.
             10 WS-DC-FEE-AMT             PIC S9(5)V99 COMP-3 VALUE +0.
             10 WS-DC-FEE-AMT-FUEL        PIC S9(5)V99 COMP-3 VALUE +0.
             10 WS-DC-FEE-AMT-CUSTOM      PIC S9(5)V99 COMP-3 VALUE +0.
             10 WS-DC-FEE-AMT-RETAIN      PIC S9(5)V99 COMP-3 VALUE +0.
             10 WS-DC-FEE-AMT-MANUAL      PIC S9(5)V99 COMP-3 VALUE +0.
             10 WS-DC-DISCOUNT-FOCUS-SELECT PIC X(1)          VALUE ' '.
             10 WS-DC-DISCOUNT-METHOD     PIC X(1)            VALUE ' '.
             10 WS-DC-REBATE-AMT          PIC S9(5)V99 COMP-3 VALUE +0.
             10 WS-DISCOUNT-TYPE-FLAG     PIC X(1)            VALUE ' '.
              88 WS-DISCOUNT-TYPE-IS-CPG                      VALUE 'G'.
              88 WS-DISCOUNT-TYPE-IS-POF                      VALUE 'F'.
              88 WS-DISCOUNT-TYPE-IS-FLT                      VALUE '1'.
              88 WS-DISCOUNT-TYPE-IS-COST-PLUS                VALUE 'C'.
              88 WS-DISCOUNT-TYPE-IS-NATS                     VALUE 'U'.
              88 WS-DISCOUNT-TYPE-IS-CPG-POF                  VALUE 'B'.
              88 WS-DISCOUNT-TYPE-IS-CPG-FLT                  VALUE '2'.
              88 WS-DISCOUNT-TYPE-IS-POF-FLT                  VALUE '3'.
              88 WS-DISCOUNT-TYPE-IS-ALL                      VALUE '4'.
CP0400       10 WS-SC-CORP-REB-AMT        PIC S9(5)V99 COMP-3 VALUE +0.
CP0400       10 WS-ADJ-FOR-CORP-REB       PIC X               VALUE ' '.
SB0614 01  WS-FMCD-MISC-AREA.
SB0614     05  WS-MERCH-SURCHRG-FLAG      PIC X(01)           VALUE ' '.
SB0614         88 APPLY-MERCH-SURCHRG     VALUE 'Y'.
SB0614     05  WS-MERCH-SURCHRG-TOTAL     PIC S9(7)V99 COMP-3 VALUE +0.
SB0115     05  WS-MINIMUM-FEE-FLAG        PIC X(1)            VALUE ' '.
SB0115         88 APPLY-SC-MIN-FEE        VALUE 'Y'.
SB0115     05  WS-MIN-FUEL-FEE-DIFF       PIC S9(3)V99 COMP-3 VALUE +0.
SB0115     05  WS-GALUP-FEE-FLAG          PIC X(1)            VALUE ' '.
SB0115         88 APPLY-SC-GALUP-FEE      VALUE 'Y'.
SB0115     05  WS-GALUP-FUEL-FEE          PIC S9(3)V99 COMP-3 VALUE +0.
SB0516     05  WS-DC-DISCOUNT-SMFL        PIC S9(5)V99 COMP-3 VALUE +0.

060512***** ADJUSTED TO ACTUAL SIZE OF WS-DISCOUNT-AND-FEE-AREA
082212 01  WS-HOLD-DISC-AND-FEE-AREA      PIC X(044).

JS0298 01  WS-TOTAL-AMOUNT-FLDS.
           05 WS-BILLABLE            PIC S9(5)V99    VALUE ZERO COMP-3.
           05 WS2-BILLABLE           PIC S9(5)V99    VALUE ZERO COMP-3.
           05 WS3-BILLABLE           PIC S9(5)V99    VALUE ZERO COMP-3.
           05 WS-NON-BILLABLE        PIC S9(5)V99    VALUE ZERO COMP-3.
           05 WS2-NON-BILLABLE       PIC S9(5)V99    VALUE ZERO COMP-3.
           05 WS3-NON-BILLABLE       PIC S9(5)V99    VALUE ZERO COMP-3.
           05 WS-CAN-BILLABLE        PIC S9(5)V99    VALUE ZERO COMP-3.
           05 WS-US-BILLABLE         PIC S9(5)V99    VALUE ZERO COMP-3.
           05 WS-CURXMN              PIC S9(6)V99    VALUE ZERO.
           05 WS2-CURXMN             PIC S9(6)V99    VALUE ZERO.
           05 WS3-CURXMN             PIC S9(6)V99    VALUE ZERO.
           05 WS-TOTAL-REQUEST       PIC S9(6)V99    VALUE ZERO COMP-3.
           05 WS2-TOTAL-REQUEST      PIC S9(6)V99    VALUE ZERO COMP-3.
           05 WS3-TOTAL-REQUEST      PIC S9(6)V99    VALUE ZERO COMP-3.
           05 WS2-BILLABLE-FUEL      PIC S9(5)V99    VALUE ZERO COMP-3.
           05 WS2-NON-BILLABLE-FUEL  PIC S9(5)V99    VALUE ZERO COMP-3.
JS0298 01  WS-HOLD-TOTAL-AMOUNT-FLDS PIC X(100).

       01  SETTLEMENT-WORK-FIELDS.
           05 WS-BALANCE-GROUP-ID               PIC S9(9) COMP-3.
           05 WS-CLOSING-GROUP-ID               PIC S9(9) COMP-3.
           05 WS-PAYMENT-GROUP-ID               PIC S9(9) COMP-3.
           05 WS-BALANCE-ITEM-NUMBER            PIC S9(7) COMP-3.
           05 WS-CLOSING-ITEM-NUMBER            PIC S9(7) COMP-3.
           05 WS-PAYMENT-ITEM-NUMBER            PIC S9(7) COMP-3.
           05 WS-CREATE-BALANCE-GROUP           PIC X(1).
           05 WS-CREATE-CLOSING-GROUP           PIC X(1).
           05 WS-CREATE-PAYMENT-GROUP           PIC X(1).
           05 WS-SETTLE-TS-CODE                 PIC X(10).
           05 WS-SETTLE-ORIG-TS                 PIC X(10).
JS0298     05 WS-SPLIT-SETTLE-FLAG              PIC X(1).
JS0298     05 WS-SPLIT-SETTLE-COUNT             PIC 9(1).

